In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
obj = pd.Series([4,5,2,1])
obj

0    4
1    5
2    2
3    1
dtype: int64

In [3]:
obj.index # attribute

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj.values

array([4, 5, 2, 1])

In [5]:
obj = pd.Series([4,5,2,1], index=["a", "b", "c", "d"])
obj

a    4
b    5
c    2
d    1
dtype: int64

In [6]:
obj["b"]

5

In [7]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj[["a", "b"]]

a    4
b    5
dtype: int64

In [10]:
obj

a    4
b    5
c    2
d    1
dtype: int64

In [11]:
obj * 2

a     8
b    10
c     4
d     2
dtype: int64

In [13]:
obj + 5

a     9
b    10
c     7
d     6
dtype: int64

In [14]:
obj > 2

a     True
b     True
c    False
d    False
dtype: bool

In [15]:
obj.max()

5

In [16]:
obj

a    4
b    5
c    2
d    1
dtype: int64

In [17]:
"b" in obj

True

In [18]:
5 in obj

False

In [19]:
5 in obj.values

True

In [20]:
sdata = {"Istanbul": 18000000, "Izmir": 4500000,
         "Bursa": 1800000, "Ankara": 5500000}

obj2 = pd.Series(sdata)
obj2

Istanbul    18000000
Izmir        4500000
Bursa        1800000
Ankara       5500000
dtype: int64

In [21]:
sdata2 = {"Izmir": 5000000, "Istanbul": 20000000, 
         "Ankara": 6000000, "Bursa": 2000000, }

obj3 = pd.Series(sdata2)
obj3

Izmir        5000000
Istanbul    20000000
Ankara       6000000
Bursa        2000000
dtype: int64

In [22]:
obj2 + obj3

Ankara      11500000
Bursa        3800000
Istanbul    38000000
Izmir        9500000
dtype: int64

In [24]:
d = {
    "Name": ["John", "Alice", "Jack", "Rose", "Alex", "David"],
    "Age": [32, 23, 21, 35, 45, 48],
    "City": ["Istanbul", "Paris", "London", "Madrid", "Sao Paulo", "Miami"]
}

data = pd.DataFrame(d)
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [25]:
data.shape

(6, 3)

In [26]:
data.dtypes

Name    object
Age      int64
City    object
dtype: object

In [27]:
data.head() # displays first 5 rows

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo

In [28]:
data.tail() # display last 5 rows

    Name  Age       City
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [30]:
data.head(2)

    Name  Age      City
0   John   32  Istanbul
1  Alice   23     Paris

In [31]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [32]:
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami']}

In [33]:
d["Name"]

['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David']

In [34]:
data["Name"]

0     John
1    Alice
2     Jack
3     Rose
4     Alex
5    David
Name: Name, dtype: object

In [35]:
data["Age"]

0    32
1    23
2    21
3    35
4    45
5    48
Name: Age, dtype: int64

In [36]:
data.head(3)

    Name  Age      City
0   John   32  Istanbul
1  Alice   23     Paris
2   Jack   21    London

In [37]:
data[:3]

    Name  Age      City
0   John   32  Istanbul
1  Alice   23     Paris
2   Jack   21    London

In [38]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [40]:
data[["Name", "Age"]] # it will return another dataFrame

    Name  Age
0   John   32
1  Alice   23
2   Jack   21
3   Rose   35
4   Alex   45
5  David   48

In [41]:
data["Name"] # returns a Series object

0     John
1    Alice
2     Jack
3     Rose
4     Alex
5    David
Name: Name, dtype: object

In [42]:
data[["Name"]] # returns a DataFrame

    Name
0   John
1  Alice
2   Jack
3   Rose
4   Alex
5  David

In [45]:
data[["Name", "Age"]][:4]

    Name  Age
0   John   32
1  Alice   23
2   Jack   21
3   Rose   35

In [47]:
# you can change the "direction"

data[:4][["Name", "Age"]]

    Name  Age
0   John   32
1  Alice   23
2   Jack   21
3   Rose   35

In [48]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [49]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [50]:
data.values

array([['John', 32, 'Istanbul'],
       ['Alice', 23, 'Paris'],
       ['Jack', 21, 'London'],
       ['Rose', 35, 'Madrid'],
       ['Alex', 45, 'Sao Paulo'],
       ['David', 48, 'Miami']], dtype=object)

In [51]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [52]:
data["debt"] = [10, 20, 30, 25, 35, 22]
data

    Name  Age       City  debt
0   John   32   Istanbul    10
1  Alice   23      Paris    20
2   Jack   21     London    30
3   Rose   35     Madrid    25
4   Alex   45  Sao Paulo    35
5  David   48      Miami    22

In [53]:
data["debt"] = [10, 20, 30, 25, 35, 27]
data

    Name  Age       City  debt
0   John   32   Istanbul    10
1  Alice   23      Paris    20
2   Jack   21     London    30
3   Rose   35     Madrid    25
4   Alex   45  Sao Paulo    35
5  David   48      Miami    27

In [54]:
data["debt"] = 20
data

    Name  Age       City  debt
0   John   32   Istanbul    20
1  Alice   23      Paris    20
2   Jack   21     London    20
3   Rose   35     Madrid    20
4   Alex   45  Sao Paulo    20
5  David   48      Miami    20

In [55]:
data.drop("debt", axis=1) # it returns another dataframe

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [57]:
#data = data.drop("debt", axis=1)
data.drop("debt", axis=1, inplace=True) # it will not return anything

In [58]:
data

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [59]:
data.drop(["Age", "City"], axis=1, inplace=True)
data

    Name
0   John
1  Alice
2   Jack
3   Rose
4   Alex
5  David

In [60]:
data.drop(2, axis=0, inplace=True)
data

    Name
0   John
1  Alice
3   Rose
4   Alex
5  David

In [61]:
data.drop([0,4,5], axis=0, inplace=True)
data

    Name
1  Alice
3   Rose

In [65]:
orders = pd.read_table("http://bit.ly/chiporders")
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [66]:
orders.shape

(4622, 5)

In [67]:
orders.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object